.emacs.d/config.org
#+TITLE: Emacs
* Cambios en la interfaz
*** Tema a utilizar
Dado que uso [[*Heaven & hell][Heaven & hell]] para cambiar dinámicamente de tema, debo usarlo para definir el tema por defecto, por ello no hay ninguna instancia de ~(load-theme)~.

#+begin_src emacs-lisp
  (setq heaven-and-hell-themes
        '((light . doom-nord-light)
          (dark . doom-dracula)))
#+end_src

*** Básicos de Emacs
    
Fuentes a usar
    #+begin_src emacs-lisp
      (set-face-attribute 'default nil :font "Source Code Pro-9.7")
      (set-face-attribute 'fixed-pitch nil :font "Source Code Pro-9.7")
      (set-face-attribute 'variable-pitch nil :font "Nimbus Sans-12")

      (set-face-attribute 'default nil :background "#31313A")
      (set-face-attribute 'hl-line nil :background "#282A36")

      (dolist (face '(default fixed-pitch))
	(set-face-attribute `,face nil :font "Source Code Pro-9.7"))


      (define-minor-mode my/variable-pitch-mode
	"Toggle `variable-pitch-mode', except for `prog-mode'."
	:init-value nil
	:global nil
	(if my/variable-pitch-mode
	    (unless (derived-mode-p 'prog-mode)
	      (variable-pitch-mode 1))
	  (variable-pitch-mode -1))) 
#+end_src

Eliminar las barras de herramientas y de desplazamiento
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(scroll-bar-mode -1)
(menu-bar-mode -1)
(global-set-key (kbd "M-m") 'menu-bar-mode) ; M-m hace aparecer el menú
#+END_SRC

Resaltar la línea actual
#+begin_src emacs-lisp
(global-hl-line-mode t)
#+end_src

Mostrar la columna y fila actual en el modeline
#+begin_src emacs-lisp
(column-number-mode 1)
#+end_src

Mostrar números de línea en modo relativo
#+begin_src emacs-lisp
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)
#+end_src

Resaltar el paréntesis que corresponde
#+begin_src emacs-lisp
(show-paren-mode t)
#+end_src

Evitar que el cursor parpadee
#+begin_src emacs-lisp
(blink-cursor-mode 0)
#+end_src

* Configuraciones básicas 
Responder con y/n
#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

Al llegar al final del texto visible sigue avanzando linea por línea, en lugar de colocar la línea actual al centro.
#+begin_src emacs-lisp
(setq scroll-conservatively 100) 
#+end_src

(Debería) desactivar todos los backups, lo que incrementa el tiempo que tarda en abrir un archivo
#+begin_src emacs-lisp
(setq make-backup-files nil) ;desactiva todos los backups
(setq backup-directory-alist
      `((".*" . ,"~/.emacs.d/backups/")))
(setq auto-save-file-name-transforms
      `((".*" ,"~/.emacs.d/backups/")))
(setq auto-save-list-file-prefix nil)
(setq auto-save-default nil)
#+end_src

Visitar más facilmente el archivo de configuración presionando ~C-c e~
#+BEGIN_SRC emacs-lisp
(defun config-visit ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "C-c e") 'config-visit)
#+END_SRC

Actualizar el ~init.el~ con ~C-c r~.
#+BEGIN_SRC emacs-lisp
  (defun config-reload ()
    (interactive)
    (org-babel-load-file "~/.repos/dotfiles/.emacs.d/config.org"))
  (global-set-key (kbd "C-c r") 'config-reload)
#+END_SRC

Al hacer un split se enfoca dicho split.
#+begin_src emacs-lisp
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+end_src

~Visual-line-mode~ siempre activo
#+begin_src emacs-lisp
(global-visual-line-mode 1)
#+end_src

Desactivar la pantalla de bienvenida y usar ~srcatch~ como pantalla inicial en org-mode
#+begin_src emacs-lisp
(setq inhibit-splash-screen t)
(setq initial-scratch-message nil)
(setq initial-major-mode (quote org-mode))
(setq vc-follow-symlinks nil)
#+end_src

* Evil-mode
VIM-like keybindings.

#+BEGIN_SRC emacs-lisp
;; Evil mode
(use-package evil
  :ensure t
  :init
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1)
  (setq-default evil-cross-lines t))
#+END_SRC

Para usar VIM keys en otros modos, usamos ~Evil-collection~

#+BEGIN_SRC emacs-lisp
(use-package evil-collection
  :after evil
  :ensure t)
  (evil-collection-init)
#+END_SRC

VIM keys en org-mode (casi no las uso)

#+BEGIN_SRC emacs-lisp
  (use-package evil-org
    :ensure t
    :after org
    :config
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
	      (lambda ()
		(evil-org-set-key-theme)))
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+END_SRC

Definiendo algunos keybindings especiales para org-agenda (entran en conflicto con org-collection)
#+begin_src emacs-lisp
  (evil-define-key 'motion org-agenda-mode-map
    (kbd "C-p") 'org-agenda-earlier
    (kbd "C-n") 'org-agenda-later)
#+end_src

VIM keys en magit

#+BEGIN_SRC emacs-lisp
(use-package evil-magit
  :ensure t)
#+END_SRC

HJKL respetan las lineas visuales
#+BEGIN_SRC emacs-lisp
(define-key evil-normal-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-normal-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
(define-key evil-motion-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-motion-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
(define-key evil-motion-state-map (kbd "C-u") 'evil-scroll-up)
#+END_SRC
* Keybindings
Matar el buffer actual
#+begin_src emacs-lisp
(global-set-key (kbd "C-x k") 'kill-current-buffer)
#+end_src

Activar visual-line-mode
#+begin_src emacs-lisp
(global-set-key (kbd "C-c v") 'visual-line-mode) ; visual line
#+end_src

Activar ispell
#+begin_src emacs-lisp
(global-set-key (kbd "<f5>")  'ispell-word) ;activar ispell
#+end_src

Evil-mode
#+begin_src emacs-lisp
(define-key evil-normal-state-map (kbd "SPC SPC") 'counsel-find-file)
(define-key evil-normal-state-map (kbd "SPC k") 'kill-current-buffer)
(define-key evil-normal-state-map (kbd "SPC b") 'ivy-switch-buffer)
(define-key evil-normal-state-map (kbd "SPC s") 'swiper)
(define-key evil-normal-state-map (kbd "SPC p") 'projectile-find-file)
(define-key evil-normal-state-map (kbd "SPC P") 'projectile-switch-project)
(define-key evil-normal-state-map (kbd "SPC g") 'magit)
(define-key evil-normal-state-map (kbd "SPC v") 'visual-line-mode)
(define-key evil-normal-state-map (kbd "SPC c") 'org-capture)
(define-key evil-normal-state-map (kbd "SPC RET") (lambda () (interactive) (shell-command "st > /dev/null 2>&1 & disown")))
#+end_src

* Doom modeline
  :PROPERTIES:
  :ORDERED:  t
  :END:
La misma barra de status que usa doom emacs
#+begin_src emacs-lisp
(use-package doom-modeline
:ensure t
:hook (after-init . doom-modeline-mode)
:config
(setq doom-modeline-height 25)
(setq doom-modeline-bar-width 4)
(setq doom-modeline-buffer-file-name-style 'relative-from-project)
(setq doom-modeline-icon t)
(setq doom-modeline-major-mode-icon t)
(setq doom-modeline-major-mode-color-icon t)
(setq doom-modeline-minor-modes nil)
(setq doom-modeline-enable-word-count t)
(setq doom-modeline-checker-simple-format t)
(setq doom-modeline-persp-name t)
(setq doom-modeline-lsp nil)
(setq doom-modeline-github t)
(setq doom-modeline-github-interval (* 30 60))
(setq doom-modeline-env-version t)
(setq doom-modeline-env-enable-python t)
(setq doom-modeline-env-enable-ruby t)
(setq doom-modeline-env-enable-perl t)
(setq doom-modeline-env-enable-go t)
(setq doom-modeline-env-enable-elixir t)
(setq doom-modeline-env-enable-rust t)
(setq doom-modeline-env-python-executable "python")
(setq doom-modeline-env-ruby-executable "ruby")
(setq doom-modeline-env-perl-executable "perl")
(setq doom-modeline-env-go-executable "go")
(setq doom-modeline-env-elixir-executable "iex")
(setq doom-modeline-env-rust-executable "rustc")
(setq doom-modeline-mu4e t)
(setq doom-modeline-irc t)
(setq doom-modeline-irc-stylize 'identity))
(doom-modeline-mode 1)
#+end_src

* Which key
Muestra los posibles comandos al comenzar a presionar keybindings.
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :init
  (which-key-mode))
#+end_src

* Ivy
La interfaz de búsqueda, reemplaza el feo minibuffer que usa por defecto emacs
#+begin_src emacs-lisp
(use-package ivy
  :ensure t
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t
        ivy-count-format "%d/%d ")
  (setq ivy-re-builders-alist '((swiper . ivy--regex-plus)
                                (t . ivy--regex-fuzzy))))
(setq ivy-extra-directories nil)
#+end_src

Ivy rich añade una descripción al usar ~M-x~
#+begin_src emacs-lisp
(use-package ivy-rich
  :ensure t
  :config
  (ivy-rich-mode 1))
#+end_src

Prescient mode agrega historial a ivy
#+begin_src emacs-lisp
(use-package ivy-prescient
  :ensure t
  :config
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))
#+end_src

Counsel añade esteroides a los mecanismos de búsqueda de archivos que emacs usa por defecto.
#+begin_src emacs-lisp
(use-package counsel
  :ensure t
  :config
  (counsel-mode 1)
  :bind (
	  ("M-x" . counsel-M-x)
	  ("C-x C-f" . counsel-find-file)))
(define-key ivy-minibuffer-map (kbd "C-j") #'ivy-immediate-done)
(define-key ivy-minibuffer-map (kbd "RET") #'ivy-alt-done)
#+end_src

all-the-icons-ivy agrega iconos a ivy
#+begin_src emacs-lisp
(use-package all-the-icons-ivy-rich
  :ensure t
  :init (all-the-icons-ivy-rich-mode 1))
#+end_src

* Swiper
Un buscador de palabras dentro del buffer. Usa un minibuffer para mostrar los resultados.
#+begin_src emacs-lisp
(use-package swiper
  :ensure t
  :bind (
	 ("C-s" . swiper)))
#+end_src

