.emacs.d/config.org
* Yasnippet
Snippets que agregan el texto por mi.
#+begin_src emacs-lisp
(use-package yasnippet
   :ensure t
   :config
   (yas-global-mode))
#+end_src

* Magit
Git en emacs
#+begin_src emacs-lisp
(use-package magit
  :ensure t)
(global-set-key (kbd "C-x C-g") 'magit)
#+end_src

* Utilidades para markdown
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
(setq markdown-command "/usr/bin/pandoc")
#+end_src

* Rainbow mode
Añade color a loc códigos hexagesimales en el texto
#+begin_src emacs-lisp
(use-package rainbow-mode
   :ensure t
   :config
   (rainbow-mode 1))
#+end_src

* All the icons
Añade íconos a varios paquetes usando la fuente awesome
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t)
#+end_src
* Doom themes
Los temas para Doom-emacs. Curiosamente, creo que se ven mejor sin el framework que agrega doom
#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :config
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-treemacs-config)
  (doom-themes-org-config))
#+end_src

* Heaven & hell
Permite cambiar de un tema oscuro a uno blanco con un botón
#+begin_src emacs-lisp
(use-package heaven-and-hell
  :ensure t
  :init
  (setq heaven-and-hell-theme-type 'dark)
  (setq heaven-and-hell-load-theme-no-confirm t)
  :hook (after-init . heaven-and-hell-init-hook)
  :bind (("C-c <f7>" . heaven-and-hell-load-default-theme)
         ("<f7>" . heaven-and-hell-toggle-theme)))
#+end_src

* Writeroom-mode
Permite activar un modo sin distracciones con el texto centrado
#+begin_src emacs-lisp
(use-package writeroom-mode
    :ensure t
    :bind ("<f6>" . writeroom-mode))
#+end_src

*** TODO Algunos hooks para writeroom-mode
El hook para desactivar Writeroom no funciona como debería
#+begin_src emacs-lisp
;  (add-hook 'writeroom-enable-mode-hook
;  	    (variable-pitch-mode 1))
;  
;  (add-hook 'writeroom-mode-disable-hook
;  	   (variable-pitch-mode -1))
  ;(add-hook 'writeroom-local-effects 'my/variable-pitch-mode)
#+end_src

* Ewal
Toma colores de pywal y genera un tema con ellos
#+begin_src emacs-lisp
(use-package ewal
  :ensure t
  :init (setq ewal-use-built-in-always-p nil
              ewal-use-built-in-on-failure-p t
              ewal-built-in-palette "sexy-material"))
#+end_src
	      
Permite a ewal generar un tema el estilo de doom-themes
#+begin_src emacs-lisp
(use-package ewal-doom-themes
  :ensure t)
#+end_src

* Paréntesis inteligentes
Smartparents agrega dos paréntesis al escribir automáticamente
#+begin_src emacs-lisp
(use-package smartparens
  :ensure t
  :config
  (smartparens-mode t))
#+end_src

Rainbow-delimiters colorea los paréntesis para identificarlos más facilmente
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+end_src

* Easy Hugo
Administrar un blog de hugo con emacs
#+begin_src emacs-lisp
(use-package easy-hugo
  :ensure t
  :init 
;;; Main blog
  (setq easy-hugo-basedir "/mnt/Data/Blog/")
  (setq easy-hugo-postdir "content/posts/")
  :config
  (add-to-list 'evil-emacs-state-modes 'easy-hugo-mode)
  (setq easy-hugo-default-ext ".org")
  (setq easy-hugo-org-header t))
#+end_src

* Terminal here
Abre una terminal directamente en el directorio del buffer actual
#+begin_src emacs-lisp
(use-package terminal-here
  :ensure t
  :config
  (setq terminal-here-terminal-command "st"))
#+end_src

* Org-mode
** Ox-pandoc
Soporte para pandoc
#+begin_src emacs-lisp
(use-package ox-pandoc
  :ensure t)
#+end_src

** Org-tree-slide
Presentaciones directamente con orgmode
#+begin_src emacs-lisp
(use-package org-tree-slide
  :ensure t
  :config
  (setq org-tree-slide-header nil)
  (setq org-tree-slide-slide-in-effect nil)
  )

(evil-define-key 'normal 'org-tree-slide-mode-map
  "{"  'org-tree-slide-move-previous-tree
  "}"  'org-tree-slide-move-next-tree)
#+end_src

Hooks para usar diferentes letras al usar tres-slide
#+begin_src emacs-lisp
(eval-after-load "org-tree-slide"
  '(progn
     (add-hook 'org-tree-slide-play-hook
	       (lambda ()
		 (org-display-inline-images 1)
		 (hide-mode-line-mode 1)
		 (display-line-numbers-mode -1)
		 (my/variable-pitch-mode 1)))
     (add-hook 'org-tree-slide-stop-hook
	       (lambda ()
		 (org-display-inline-images -1)
		 (hide-mode-line-mode -1)
		 (display-line-numbers-mode 1)
		 (my/variable-pitch-mode -1)))))
#+end_src

** Org-superstar
Org-bullets, con esteroides
#+begin_src emacs-lisp
  (use-package org-superstar
    :ensure t)
#+end_src

Configuraciones especiales para usar un estilo más agradable
#+begin_src emacs-lisp
;;; Titles and Sections
(setq org-hidden-keywords '(title))
;; set basic title font
(set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
;; Low levels are unimportant => no scaling
(set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
(set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
(set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
(set-face-attribute 'org-level-4 nil :inherit 'org-level-8)
;; Top ones get scaled the same as in LaTeX (\large, \Large, \LARGE)
(set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.2) ;\large
(set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.44) ;\Large
(set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.728) ;\LARGE
;; Only use the first 4 styles and do not cycle.
(setq org-cycle-level-faces nil)
(setq org-n-level-faces 4)
;; Document Title, (\huge)
(set-face-attribute 'org-document-title nil
                    :height 2.074
                    :foreground 'unspecified
                    :inherit 'org-level-8)
#+end_src

Hook para que funcione
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
          (lambda ()
            (org-superstar-mode 1)))
#+end_src

** Agenda
Definir un directorio para org-mode
#+begin_src emacs-lisp
      (setq org-directory "/mnt/ORG/")
#+end_src

Definir un atajo para abrir la agenda
#+begin_src emacs-lisp
      (global-set-key (kbd "C-c a") 'org-agenda)
#+end_src

Configurar la agenda para aparecer en otro buffer
#+begin_src emacs-lisp
      (setq org-agenda-window-setup
	    'other-window)
#+end_src

Configurar la agenda para que solamente muestre los próximos 3 días
#+begin_src emacs-lisp
      (setq org-agenda-span 3)
#+end_src

La agenda comienza en lunes
#+begin_src emacs-lisp
      (setq org-agenda-start-on-weekday nil)
#+end_src

Colocar los nombres de los dias y meses en español

#+begin_src emacs-lisp
      (setq calendar-day-name-array ["domingo" "lunes" "martes" "miércoles" "jueves" "viernes" "sábado"])
      (setq calendar-month-name-array ["enero" "febrero" "marzo" "abril" "mayo" "junio" "julio" "agosto" "septiembre" "octubre" "noviembre" "diciembre"])
#+end_src

Elimina ese ~======~ entre bloques de la agenda
#+begin_src emacs-lisp
      (setq org-agenda-block-separator (string-to-char " "))
#+end_src

Elimina las frases ~SCHEDULED:~ y traduce las ~DEADLINE:~ en las entradas agendadas
#+begin_src emacs-lisp
      (setq org-agenda-scheduled-leaders 
	    '("" " "))
      (setq org-agenda-deadline-leaders 
	    '("Fecha límite:  " "En %d días: " "Hace %d días: "))
#+end_src

Fuentes personalizadas para la agenda UwU
#+begin_src emacs-lisp
  (custom-theme-set-faces 'user
			  '(org-agenda-date-today ((t (:foreground "#d7befb" :weight ultra-bold :height 130 :family "Ubuntu")))) ;El día actual
			  '(org-agenda-structure ((t (:foreground "#ffffff" :underline t :weight bold :height 200 :width normal :family "Ubuntu")))) ;Los títulos
			  '(org-agenda-calendar-event ((t (:family "Ubuntu" :inherit (default))))) ;El texto
			  )
#+end_src
      
Mi agenda personalizada, se ejecuta con "o"
#+begin_src emacs-lisp
      (setq org-agenda-custom-commands
	    '(("o" "My Agenda"
	       ((todo "TODO" (
			    (org-agenda-overriding-header " Tareas por hacer:\n")
			    (tags-todo "TODO")
			    (org-agenda-remove-tags t)
			    (org-agenda-prefix-format "%T %?-s")
			    (org-agenda-todo-keyword-format "")))
		(agenda "" (
			    (org-agenda-overriding-header " Eventos para hoy:\n")
			    (org-agenda-skip-scheduled-if-done t)
			    (org-agenda-skip-timestamp-if-done t)
			    (org-agenda-skip-deadline-if-done t)
			    (org-agenda-skip-deadline-prewarning-if-scheduled t)
			    (org-agenda-start-day "+0d")
			    (org-agenda-span 3)
			    (org-agenda-prefix-format "  %?-t %T %?-5s")
			    (org-agenda-repeating-timestamp-show-all nil)
			    (org-agenda-remove-tags t)
			     ;; (concat "  %-3i  %-15b %t%s" org-agenda-hidden-separator))
			    (org-agenda-todo-keyword-format " -> ")
			    (org-agenda-time)
			    (org-agenda-current-time-string "⮜┈┈┈┈┈┈┈ now")
			    ;; (org-agenda-scheduled-leaders '("" ""))
			    ;; (org-agenda-deadline-leaders '("" ""))
			    (org-agenda-time-grid (quote ((today require-timed) (800 1000 1200 1400 1600 1800 2000 2200) "      " "┈┈┈┈┈┈┈┈┈┈┈┈┈"))))
    )))))
#+end_src

Para spawnear una agenda flotante
#+begin_src emacs-lisp
      ;; Agenda flotante
      (defun agenda-frame ()
	(interactive)
	(org-agenda nil "o")
	(delete-other-windows))
#+end_src

