.emacs.d/config.el

(use-package yasnippet
   :ensure t
   :config
   (yas-global-mode))

(use-package magit
  :ensure t)
(global-set-key (kbd "C-x C-g") 'magit)

(use-package markdown-mode
  :ensure t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
(setq markdown-command "/usr/bin/pandoc")

(use-package rainbow-mode
   :ensure t
   :config
   (rainbow-mode 1))

(use-package all-the-icons
  :ensure t)

(use-package doom-themes
  :ensure t
  :config
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-treemacs-config)
  (doom-themes-org-config))

(use-package heaven-and-hell
  :ensure t
  :init
  (setq heaven-and-hell-theme-type 'dark)
  (setq heaven-and-hell-load-theme-no-confirm t)
  :hook (after-init . heaven-and-hell-init-hook)
  :bind (("C-c <f7>" . heaven-and-hell-load-default-theme)
         ("<f7>" . heaven-and-hell-toggle-theme)))

(use-package writeroom-mode
    :ensure t
    :bind ("<f6>" . writeroom-mode))

;  (add-hook 'writeroom-enable-mode-hook
;  	    (variable-pitch-mode 1))
;  
;  (add-hook 'writeroom-mode-disable-hook
;  	   (variable-pitch-mode -1))
  ;(add-hook 'writeroom-local-effects 'my/variable-pitch-mode)

(use-package ewal
  :ensure t
  :init (setq ewal-use-built-in-always-p nil
              ewal-use-built-in-on-failure-p t
              ewal-built-in-palette "sexy-material"))

(use-package ewal-doom-themes
  :ensure t)

(use-package smartparens
  :ensure t
  :config
  (smartparens-mode t))

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package easy-hugo
  :ensure t
  :init 
;;; Main blog
  (setq easy-hugo-basedir "/mnt/Data/Blog/")
  (setq easy-hugo-postdir "content/posts/")
  :config
  (add-to-list 'evil-emacs-state-modes 'easy-hugo-mode)
  (setq easy-hugo-default-ext ".org")
  (setq easy-hugo-org-header t))

(use-package terminal-here
  :ensure t
  :config
  (setq terminal-here-terminal-command "alacritty"))

(use-package ox-pandoc
  :ensure t)

(use-package org-tree-slide
  :ensure t
  :config
  (setq org-tree-slide-header nil)
  (setq org-tree-slide-slide-in-effect nil)
  )

(evil-define-key 'normal 'org-tree-slide-mode-map
  "{"  'org-tree-slide-move-previous-tree
  "}"  'org-tree-slide-move-next-tree)

(eval-after-load "org-tree-slide"
  '(progn
     (add-hook 'org-tree-slide-play-hook
	       (lambda ()
		 (org-display-inline-images 1)
		 (hide-mode-line-mode 1)
		 (display-line-numbers-mode -1)
		 (my/variable-pitch-mode 1)))
     (add-hook 'org-tree-slide-stop-hook
	       (lambda ()
		 (org-display-inline-images -1)
		 (hide-mode-line-mode -1)
		 (display-line-numbers-mode 1)
		 (my/variable-pitch-mode -1)))))

(use-package org-superstar
  :ensure t)

;;; Titles and Sections
(setq org-hidden-keywords '(title))
;; set basic title font
(set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
;; Low levels are unimportant => no scaling
(set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
(set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
(set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
(set-face-attribute 'org-level-4 nil :inherit 'org-level-8)
;; Top ones get scaled the same as in LaTeX (\large, \Large, \LARGE)
(set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.2) ;\large
(set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.44) ;\Large
(set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.728) ;\LARGE
;; Only use the first 4 styles and do not cycle.
(setq org-cycle-level-faces nil)
(setq org-n-level-faces 4)
;; Document Title, (\huge)
(set-face-attribute 'org-document-title nil
                    :height 2.074
                    :foreground 'unspecified
                    :inherit 'org-level-8)

(add-hook 'org-mode-hook
          (lambda ()
            (org-superstar-mode 1)))

(setq org-directory "/mnt/ORG/")

(global-set-key (kbd "C-c a") 'org-agenda)

(setq org-agenda-window-setup
      'other-window)

(setq org-agenda-span 3)

(setq org-agenda-start-on-weekday nil)

(setq calendar-day-name-array ["domingo" "lunes" "martes" "miércoles" "jueves" "viernes" "sábado"])
(setq calendar-month-name-array ["enero" "febrero" "marzo" "abril" "mayo" "junio" "julio" "agosto" "septiembre" "octubre" "noviembre" "diciembre"])

(setq org-agenda-block-separator (string-to-char " "))

(setq org-agenda-scheduled-leaders 
      '("" " "))
(setq org-agenda-deadline-leaders 
      '("Fecha límite:  " "En %d días: " "Hace %d días: "))

(custom-theme-set-faces 'user
			'(org-agenda-date-today ((t (:foreground "#d7befb" :weight ultra-bold :height 130 :family "Ubuntu")))) ;El día actual
			'(org-agenda-structure ((t (:foreground "#ffffff" :underline t :weight bold :height 200 :width normal :family "Ubuntu")))) ;Los títulos
			'(org-agenda-calendar-event ((t (:family "Ubuntu" :inherit (default))))) ;El texto
			)

(setq org-agenda-custom-commands
	'(("o" "My Agenda"
	   ((todo "TODO" (
			(org-agenda-overriding-header " Tareas por hacer:\n")
			(tags-todo "TODO")
			(org-agenda-remove-tags t)
			(org-agenda-prefix-format "%T %?-s")
			(org-agenda-todo-keyword-format "")))
	    (agenda "" (
			(org-agenda-overriding-header " Eventos para hoy:\n")
			(org-agenda-skip-scheduled-if-done t)
			(org-agenda-skip-timestamp-if-done t)
			(org-agenda-skip-deadline-if-done t)
			(org-agenda-skip-deadline-prewarning-if-scheduled t)
			(org-agenda-start-day "+0d")
			(org-agenda-span 3)
			(org-agenda-prefix-format "  %?-t %T %?-5s")
			(org-agenda-repeating-timestamp-show-all nil)
			(org-agenda-remove-tags t)
			 ;; (concat "  %-3i  %-15b %t%s" org-agenda-hidden-separator))
			(org-agenda-todo-keyword-format " -> ")
			(org-agenda-time)
			(org-agenda-current-time-string "⮜┈┈┈┈┈┈┈ now")
			;; (org-agenda-scheduled-leaders '("" ""))
			;; (org-agenda-deadline-leaders '("" ""))
			(org-agenda-time-grid (quote ((today require-timed) (800 1000 1200 1400 1600 1800 2000 2200) "      " "┈┈┈┈┈┈┈┈┈┈┈┈┈"))))
)))))

;; Agenda flotante
(defun agenda-frame ()
  (interactive)
  (org-agenda nil "o")
  (delete-other-windows))
