.emacs.d/config.org
** Convertir TODO en DONE cuando las subtareas haan sido marcadas como DONE
   Código traido a ustedes gracias a la documentación de orgmode
#+begin_src emacs-lisp
(defun org-summary-todo (n-done n-not-done)
  "Switch entry to DONE when all subentries are done, to TODO otherwise."
  (let (org-log-done org-log-states)   ; turn off logging
    (org-todo (if (= n-not-done 0) "DONE" "PROJ"))))

(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
#+end_src
** Keybinding para cambiar de TODO state
#+begin_src emacs-lisp
  (evil-define-key 'normal org-mode-map
    (kbd "SPC t") 'org-todo)
#+end_src
** Org-capture flotante
#+begin_src emacs-lisp
;; Org capture flotante
(defadvice org-capture-finalize
(after delete-capture-frame activate)
"Advise capture-finalize to close the frame"
(if (equal "capture" (frame-parameter nil 'name))
(delete-frame)))

(defadvice org-capture-destroy
(after delete-capture-frame activate)
"Advise capture-destroy to close the frame"
(if (equal "capture" (frame-parameter nil 'name))
(delete-frame)))
#+end_src

** Almacenar texto como un link
#+begin_src emacs-lisp
(global-set-key (kbd "C-c l") 'org-store-link)
#+end_src

** Plantillas de org-capture
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c c") 'org-capture)
  (setq org-capture-templates
	'(
  ;	("i" "Inbox" entry
  ;	 (file "~/Drive/GTD/inbox.org")
  ;	 "* %?\n%u" :prepend t)
  
	  ("t" "Entradas del trabajo")
	  ("tt" "TODO" entry
	   (file "~/mnt/DATA/ORG/Trabajo.org")
	   "* TODO %?\n%u" :prepend t)

	  ("ta" "Agenda"  entry
	   (file "~/mnt/DATA/ORG/Trabajo.org")
	   "* %?\n SCHEDULED: %t")
	
	  ("p" "Entradas personales")
	  ("pt" "TODO" entry
	   (file "~/mnt/DATA/ORG/Trabajo.org")
	   "* TODO %?\n%u" :prepend t)

	  ("pa" "Agenda"  entry
	   (file "~/mnt/DATA/ORG/Trabajo.org")
	   "* %?\n SCHEDULED: %t")
  ;;	("n" "Notas" entry
  ;;	 (file+headline "~/Drive/GTD/referencias.org" "Notas")
  ;;	 "* %?" :prepend t)
  ;;
  ;;	("d" "Diario" entry
  ;;	 (file+olp+datetree "~/Drive/SEC-ABREOJOS/DIARIO.org")
  ;;	 "* %?" :prepend t)
  ))
#+end_src

** Exportar en beamer
#+begin_src emacs-lisp
(org-beamer-mode)
#+end_src

** Clases para LaTeX
Koma-script
#+begin_src emacs-lisp
(add-to-list 'org-latex-classes
      '("koma-article"
	"\\documentclass{scrartcl}"
	("\\section{%s}" . "\\section*{%s}")
	("\\subsection{%s}" . "\\subsection*{%s}")
	("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	("\\paragraph{%s}" . "\\paragraph*{%s}")
	("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+end_src

Documento recepcional (?)
#+begin_src emacs-lisp
(add-to-list 'org-latex-classes
	     '("doc-recepcional"
	       "\\documentclass{report}"
	       ("\\chapter{%s}" . "\\chapter*{%s}")
	       ("\\section{%s}" . "\\section*{%s}")
	       ("\\subsection{%s}" . "\\subsection*{%s}")
	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	       ("\\paragraph{%s}" . "\\paragraph*{%s}")
	       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
	       )
)
#+end_src

Modern-cv
#+begin_src emacs-lisp
(add-to-list 'org-latex-classes
	     '("moderncv"
	       "\\documentclass{moderncv}"
	       ("\\section{%s}" . "\\section*{%s}}")
	       ("\\subsection{%s}" . "\\subsection*{%s}}")
	       )
	     )
#+end_src

** Fuentes para org-mode
#+begin_src emacs-lisp
       
(custom-theme-set-faces 'user
 '(org-block ((t (:inherit fixed-pitch))))
 '(org-block-begin-line ((t (:inherit fixed-pitch))))
 '(org-block-end-line ((t (:inherit fixed-pitch))))
 '(org-code ((t (:inherit fixed-pitch))))
 '(org-document-info-keyword ((t (:inherit fixed-pitch))))
 '(org-meta-line ((t (:inherit fixed-pitch))))
 '(org-table ((t (:inherit fixed-pitch))))
 '(org-verbatim ((t (:inherit fixed-pitch))))
)
#+end_src

** Atajos para bloques SRC
Hay que definir los atajos de teclado para los bloques de código. Podemos escribirlos rápidamente presionando ~C-c C-,~ o ~<s~.
#+BEGIN_SRC emacs-lisp
(require 'org-tempo)
(setq org-structure-template-alist
   '(("el" . "src emacs-lisp")
     ("a" . "export ascii")
     ("c" . "center")
     ("C" . "comment")
     ("e" . "example")
     ("E" . "export")
     ("h" . "export html")
     ("x" . "export latex")
     ("q" . "quote")
     ("s" . "src")
     ("v" . "verse")))
#+END_SRC

** Org-superagenda
Org-agenda para el ricing
#+begin_src emacs-lisp
  (use-package org-super-agenda
  :ensure t)
  (let ((org-super-agenda-groups
	 '(;; Each group has an implicit boolean OR operator between its selectors.
	   (:name "Para hoy"  ; Optionally specify section name
		  :scheduled today)  ; Items that appear on the time grid
	   (:name "Tareas pendientes"
		  ;; Single arguments given alone
		  :todo "TODO")
	   (:name "Eventos para los próximos 3 días"
		  :scheduled t
		  :deadline t)
	   ;; Set order of multiple groups at once
	   (:order-multi (2 (:name "Shopping in town"
				   ;; Boolean AND group matches items that match all subgroups
				   :and (:tag "shopping" :tag "@town"))
			    (:name "Food-related"
				   ;; Multiple args given in list with implicit OR
				   :tag ("food" "dinner"))
			    (:name "Personal"
				   :habit t
				   :tag "personal")
			    (:name "Space-related (non-moon-or-planet-related)"
				   ;; Regexps match case-insensitively on the entire entry
				   :and (:regexp ("space" "NASA")
						 ;; Boolean NOT also has implicit OR between selectors
						 :not (:regexp "moon" :tag "planet")))))
	   ;; Groups supply their own section names when none are given
	   (:todo "WAITING" :order 8)  ; Set order of this section
	   (:todo ("SOMEDAY" "TO-READ" "CHECK" "TO-WATCH" "WATCHING")
		  ;; Show this group at the end of the agenda (since it has the
		  ;; highest number). If you specified this group last, items
		  ;; with these todo keywords that e.g. have priority A would be
		  ;; displayed in that group instead, because items are grouped
		  ;; out in the order the groups are listed.
		  :order 9)
	   (:priority<= "B"
			;; Show this section after "Today" and "Important", because
			;; their order is unspecified, defaulting to 0. Sections
			;; are displayed lowest-number-first.
			:order 1)
	   ;; After the last group, the agenda will display items that didn't
	   ;; match any of these groups, with the default order position of 99
	   )))
    (org-agenda nil "a"))
#+end_src

* Lua-mode
Añade soporte para lua, que no existe por defecto
#+begin_src emacs-lisp
  (use-package lua-mode
    :ensure t)

  (use-package luarocks
    :ensure t)
#+end_src
* Company
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :config
    (company-mode 1))
#+end_src
* set font for emoji
#+BEGIN_SRC emacs-lisp
  ;;(setq use-default-font-for-symbols nil)
  (set-fontset-font t '(#xF01C9 . #xF0A88) "Material Design Icons")
  ;; Add Apple Color Emoji to the default symbol fontset used by Emacs
#+END_SRC
* Dired-mode como administrador de archivos
Dired puede ser usado como administrador de archivos. Por defecto es algo inusable, pero con un par de paquetes se puede convertir en el reemplazo perfecto de lf, nnn, vifm y ranger.

** TODO Ranger-dired
Añade una interfaz y atajos de teclado similares a los de ranger
#+begin_src emacs-lisp
  (use-package ranger
    :ensure t)
  (setq ranger-cleanup-on-disable t)
  (setq ranger-cleanup-eagerly t)
  (setq ranger-parent-depth 0)
  (setq ranger-width-preview 0.30)
  (setq ranger-show-literal nil)
  (setq ranger-modify-header nil)
  (setq ranger-excluded-extensions '("mpg" "mpeg" "mp3" "mp4" "avi" "wmv" "wav" "mov" "flv" "ogm" "ogg" "mkv" "doc" "xls" "ppt" "odt" "ods" "odg" "odp" "docx" "xlsx" "odtx" "pdf" "ps" "ps.gz" "dvi"))
#+end_src
** Openwith
No todo lo quiero abrir con emacs, muchos archivos deben ser ejecutados en programas externos.
#+begin_src emacs-lisp
  (use-package openwith
    :ensure t)
    (when (require 'openwith nil 'noerror)
      (setq openwith-associations
	    (list
	     (list (openwith-make-extension-regexp
		    '("mpg" "mpeg" "mp3" "mp4"
		      "avi" "wmv" "wav" "mov" "flv"
		      "ogm" "ogg" "mkv"))
		   "mpv"
		   '(file))
	     (list (openwith-make-extension-regexp
		    '("doc" "xls" "ppt" "odt" "ods" "odg" "odp" "docx" "xlsx" "odtx"))
		   "libreoffice"
		   '(file))
	     (list (openwith-make-extension-regexp
		    '("pdf" "ps" "ps.gz" "dvi"))
		   "zathura"
		   '(file))
	     ))
      (openwith-mode 1))
#+end_src
** All-the-icons
#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :ensure t)
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+end_src
** Personalizando dired
#+begin_src emacs-lisp
  (setq dired-hide-details-mode t)
  (setq dired-hide-details-hide-symlink-targets nil)
  (setq dired-listing-switches "-lFaGh1 --group-directories-first")

#+end_src
