.emacs.d/config.el

;;  (use-package dired-open
;;    :ensure t)
;;
;;  (setq dired-open-extensions
;;	'(("pdf" . "zathura")
;;	  ("mkv" . "mpv")
;;	  ("mp4" . "mpv")
;;	  ("avi" . "mpv")
;;	  ("html" . "firefox")
;;	  ("mp3" . "mpv")
;;	  ("ogg" . "mpv")
;;	  ("flac" . "mpv")
;;	  ("aac" . "mpv")
;;	  ("jpg" . "rifle_sxiv.sh")
;;	  ("png" . "rifle_sxiv.sh")
;;	  ("gif" . "sxiv -a")
;;	  ("doc" . "libreoffice")
;;	  ("docx" . "libreoffice")
;;	  ("odt" . "libreoffice")
;;	  ("ppt" . "libreoffice")
;;	  ("pptx" . "libreoffice")
;;	  ("odp" . "libreoffice")
;;	  ("xls" . "libreoffice")
;;	  ("xlsx" . "libreoffice")
;;	  ("ods" . "libreoffice")
;;  ))

(use-package dired-hide-dotfiles
  :ensure t)
  
(defun my-dired-mode-hook ()
  "My `dired' mode hook."
  ;; To hide dot-files by default
  (dired-hide-dotfiles-mode)

  ;; To toggle hiding
  (define-key dired-mode-map "." #'dired-hide-dotfiles-mode))

(add-hook 'dired-mode-hook #'my-dired-mode-hook)
